george-hopkins/hcs12mem/target/io_mc9s12a64.h
/* INT map 2 of 2 */

#define HPRIO  0x001f
#  define HPRIO_PSEL7 0x80
#  define HPRIO_PSEL6 0x40
#  define HPRIO_PSEL5 0x20
#  define HPRIO_PSEL4 0x10
#  define HPRIO_PSEL3 0x08
#  define HPRIO_PSEL2 0x04
#  define HPRIO_PSEL1 0x02
   /* #  define HPRIO_ 0x01 */

/* reserved 0x0020..0x0027 */

/* BKP */

#define BKPCT0 0x0028
#  define BKPCT0_BKEN 0x80
#  define BKPCT0_BKFULL 0x40
#  define BKPCT0_BKBDM 0x20
#  define BKPCT0_BKTAG 0x10
   /* #  define BKPCT0_ 0x08 */
   /* #  define BKPCT0_ 0x04 */
   /* #  define BKPCT0_ 0x02 */
   /* #  define BKPCT0_ 0x01 */
#define BKPCT1 0x0029
#  define BKPCT1_BK0MBH 0x80
#  define BKPCT1_BK0MBL 0x40
#  define BKPCT1_BK1MBH 0x20
#  define BKPCT1_BK1MBL 0x10
#  define BKPCT1_BK0RWE 0x08
#  define BKPCT1_BK0RW 0x04
#  define BKPCT1_BK1RWE 0x02
#  define BKPCT1_BK1RW 0x01
#define BKP0X  0x002a
   /* #  define BKP0X_ 0x80 */
   /* #  define BKP0X_ 0x40 */
#  define BKP0X_BK0V5 0x20
#  define BKP0X_BK0V4 0x10
#  define BKP0X_BK0V3 0x08
#  define BKP0X_BK0V2 0x04
#  define BKP0X_BK0V1 0x02
#  define BKP0X_BK0V0 0x01
#define BKP0H  0x002b
#define BKP0L  0x002c
#define BKP1X  0x002d
   /* #  define BKP1X_ 0x80 */
   /* #  define BKP1X_ 0x40 */
#  define BKP1X_BK1V5 0x20
#  define BKP1X_BK1V4 0x10
#  define BKP1X_BK1V3 0x08
#  define BKP1X_BK1V2 0x04
#  define BKP1X_BK1V1 0x02
#  define BKP1X_BK1V0 0x01
#define BKP1H  0x002e
#define BKP1L  0x002f

/* MMC map 4 of 4 */

#define PPAGE 0x0030
   /* #  define PPAGE_ 0x80 */
   /* #  define PPAGE_ 0x40 */
#  define PPAGE_PIX5 0x20
#  define PPAGE_PIX4 0x10
#  define PPAGE_PIX3 0x08
#  define PPAGE_PIX2 0x04
#  define PPAGE_PIX1 0x02
#  define PPAGE_PIX0 0x01
/* #define RESERVED_0x0031 0x0031 */

/* MEBI map 3 of 3 */

#define PORTK 0x0032
#  define PORTK_BIT7 0x80
#  define PORTK_BIT6 0x40
#  define PORTK_BIT5 0x20
#  define PORTK_BIT4 0x10
#  define PORTK_BIT3 0x08
#  define PORTK_BIT2 0x04
#  define PORTK_BIT1 0x02
#  define PORTK_BIT0 0x01
#define DDRK  0x0033
#  define DDRK_BIT7 0x80
#  define DDRK_BIT6 0x40
#  define DDRK_BIT5 0x20
#  define DDRK_BIT4 0x10
#  define DDRK_BIT3 0x08
#  define DDRK_BIT2 0x04
#  define DDRK_BIT1 0x02
#  define DDRK_BIT0 0x01
#define SYNR  0x0034
   /* #  define SYNR_ 0x80 */
   /* #  define SYNR_ 0x40 */
#  define SYNR_SYN5 0x20
#  define SYNR_SYN4 0x10
#  define SYNR_SYN3 0x08
#  define SYNR_SYN2 0x04
#  define SYNR_SYN1 0x02
#  define SYNR_SYN0 0x01
#define REFDV 0x0035
   /* #  define REFDV_ 0x80 */
   /* #  define REFDV_ 0x40 */
   /* #  define REFDV_ 0x20 */
   /* #  define REFDV_ 0x10 */
#  define REFDV_REFDV3 0x08
#  define REFDV_REFDV2 0x04
#  define REFDV_REFDV1 0x02
#  define REFDV_REFDV0 0x01
#define CTFLG 0x0036 /* test only */
#define CRGFLG 0x0037
#  define CRGFLG_RTIF 0x80
#  define CRGFLG_PORF 0x40
   /* #  define CRGFLG_ 0x20 */
#  define CRGFLG_LOCKIF 0x10
#  define CRGFLG_LOCK 0x08
#  define CRGFLG_TRACK 0x04
#  define CRGFLG_SCMIF 0x02
#  define CRGFLG_SCM 0x01
#define CRGINT 0x0038
#  define CRGINT_RTIE 0x80
   /* #  define CRGINT_ 0x40 */
   /* #  define CRGINT_ 0x20 */
#  define CRGINT_LOCKIE 0x10
   /* #  define CRGINT_ 0x08 */
   /* #  define CRGINT_ 0x04 */
#  define CRGINT_SCMIE 0x02
   /* #  define CRGINT_ 0x01 */
#define CLKSEL 0x0039
#  define CLKSEL_PLLSEL 0x80
#  define CLKSEL_PSTP 0x40
#  define CLKSEL_SYSWAI 0x20
#  define CLKSEL_ROAWAI 0x10
#  define CLKSEL_PLLWAI 0x08
#  define CLKSEL_CWAI 0x04
#  define CLKSEL_RTIWAI 0x02
#  define CLKSEL_COPWAI 0x01
#define PLLCTL 0x003a
#  define PLLCTL_CME 0x80
#  define PLLCTL_PLLON 0x40
#  define PLLCTL_AUTO 0x20
#  define PLLCTL_ACQ 0x10
   /* #  define PLLCTL_ 0x08 */
#  define PLLCTL_PRE 0x04
#  define PLLCTL_PCE 0x02
#  define PLLCTL_SCME 0x01
#define RTICTL 0x003b
   /* #  define RTICTL_ 0x80 */
#  define RTICTL_RTR6 0x40
#  define RTICTL_RTR5 0x20
#  define RTICTL_RTR4 0x10
#  define RTICTL_RTR3 0x08
#  define RTICTL_RTR2 0x04
#  define RTICTL_RTR1 0x02
#  define RTICTL_RTR0 0x01
#define COPCTL 0x003c
#  define COPCTL_WCOP 0x80
#  define COPCTL_RSBCK 0x40
   /* #  define COPCTL_ 0x20 */
   /* #  define COPCTL_ 0x10 */
   /* #  define COPCTL_ 0x08 */
#  define COPCTL_CR2 0x04
#  define COPCTL_CR1 0x02
#  define COPCTL_CR0 0x01
#define FORBYP 0x003d /* test only */
#define CTCTL  0x003e /* test only */
#define ARMCOP 0x003f

/* ECT */

#define TIOS 0x0040
#  define TIOS_IOS7 0x80
#  define TIOS_IOS6 0x40
#  define TIOS_IOS5 0x20
#  define TIOS_IOS4 0x10
#  define TIOS_IOS3 0x08
#  define TIOS_IOS2 0x04
#  define TIOS_IOS1 0x02
#  define TIOS_IOS0 0x01
#define CFORC 0x0041
#  define CFORC_FOC7 0x80
#  define CFORC_FOC6 0x40
#  define CFORC_FOC5 0x20
#  define CFORC_FOC4 0x10
#  define CFORC_FOC3 0x08
#  define CFORC_FOC2 0x04
#  define CFORC_FOC1 0x02
#  define CFORC_FOC0 0x01
#define OC7M 0x0042
#  define OC7M_OC7M7 0x80
#  define OC7M_OC7M6 0x40
#  define OC7M_OC7M5 0x20
#  define OC7M_OC7M4 0x10
#  define OC7M_OC7M3 0x08
#  define OC7M_OC7M2 0x04
#  define OC7M_OC7M1 0x02
#  define OC7M_OC7M0 0x01
#define OC7D 0x0043
#  define OC7D_OC7D7 0x80
#  define OC7D_OC7D6 0x40
#  define OC7D_OC7D5 0x20
#  define OC7D_OC7D4 0x10
#  define OC7D_OC7D3 0x08
#  define OC7D_OC7D2 0x04
#  define OC7D_OC7D1 0x02
#  define OC7D_OC7D0 0x01
#define TCNT 0x0044
#define TCNTHI 0x0044
#define TCNTLO 0x0045
#define TSCR1 0x0046
#  define TSCR1_TEN 0x80
#  define TSCR1_TSWAI 0x40
#  define TSCR1_TSFRZ 0x20
#  define TSCR1_TFFCA 0x10
   /* #  define TSCR1_ 0x08 */
   /* #  define TSCR1_ 0x04 */
   /* #  define TSCR1_ 0x02 */
   /* #  define TSCR1_ 0x01 */
#define TTOV 0x0047
#  define TTOV_TOV7 0x80
#  define TTOV_TOV6 0x40
#  define TTOV_TOV5 0x20
#  define TTOV_TOV4 0x10
#  define TTOV_TOV3 0x08
#  define TTOV_TOV2 0x04
#  define TTOV_TOV1 0x02
#  define TTOV_TOV0 0x01
#define TCTL1 0x0048
#  define TCTL1_OM7 0x80
#  define TCTL1_OL7 0x40
#  define TCTL1_OM6 0x20
#  define TCTL1_OL6 0x10
#  define TCTL1_OM5 0x08
#  define TCTL1_OL5 0x04
#  define TCTL1_OM4 0x02
#  define TCTL1_OL4 0x01
#define TCTL2 0x0049
#  define TCTL2_OM3 0x80
#  define TCTL2_OL3 0x40
#  define TCTL2_OM2 0x20
#  define TCTL2_OL2 0x10
#  define TCTL2_OM1 0x08
#  define TCTL2_OL1 0x04
#  define TCTL2_OM0 0x02
#  define TCTL2_OL0 0x01
#define TCTL3 0x004a
#  define TCTL3_EDG7B 0x80
#  define TCTL3_EDG7A 0x40
#  define TCTL3_EDG6B 0x20
#  define TCTL3_EDG6A 0x10
#  define TCTL3_EDG5B 0x08
#  define TCTL3_EDG5A 0x04
#  define TCTL3_EDG4B 0x02
#  define TCTL3_EDG4A 0x01
#define TCTL4 0x004b
#  define TCTL4_EDG3B 0x80
#  define TCTL4_EDG3A 0x40
#  define TCTL4_EDG2B 0x20
#  define TCTL4_EDG2A 0x10
#  define TCTL4_EDG1B 0x08
#  define TCTL4_EDG1A 0x04
#  define TCTL4_EDG0B 0x02
#  define TCTL4_EDG0A 0x01
#define TIE 0x004c
#  define TIE_C7I 0x80
#  define TIE_C6I 0x40
#  define TIE_C5I 0x20
#  define TIE_C4I 0x10
#  define TIE_C3I 0x08
#  define TIE_C2I 0x04
#  define TIE_C1I 0x02
#  define TIE_C0I 0x01
#define TCSR2 0x004d
#  define TCSR2_TOI 0x80
   /* #  define TCSR2_ 0x40 */
   /* #  define TCSR2_ 0x20 */
   /* #  define TCSR2_ 0x10 */
#  define TCSR2_TCRE 0x08
#  define TCSR2_PR2 0x04
#  define TCSR2_PR1 0x02
#  define TCSR2_PR0 0x01
#define TFLG1 0x004e
#  define TFLG1_C7F 0x80
#  define TFLG1_C6F 0x40
#  define TFLG1_C5F 0x20
#  define TFLG1_C4F 0x10
#  define TFLG1_C3F 0x08
#  define TFLG1_C2F 0x04
#  define TFLG1_C1F 0x02
#  define TFLG1_C0F 0x01
#define TFLG2 0x004f
#  define TFLG2_TOF 0x80
   /* #  define TFLG2_ 0x40 */
   /* #  define TFLG2_ 0x20 */
   /* #  define TFLG2_ 0x10 */
   /* #  define TFLG2_ 0x08 */
   /* #  define TFLG2_ 0x04 */
   /* #  define TFLG2_ 0x02 */
   /* #  define TFLG2_ 0x01 */
#define TC0 0x0050
#define TC0HI 0x0050
#define TC0LO 0x005
#define TC1 0x0052
#define TC1HI 0x0052
#define TC1LO 0x005
#define TC2 0x0054
#define TC2HI 0x0054
#define TC2LO 0x005
#define TC3 0x0056
#define TC3HI 0x0056
#define TC3LO 0x005
#define TC4 0x0058
#define TC4HI 0x0058
#define TC4LO 0x005
#define TC5 0x005a
#define TC5HI 0x005a
#define TC5LO 0x005
#define TC6 0x005c
#define TC6HI 0x005c
#define TC6LO 0x005
#define TC7 0x005e
#define TC7HI 0x005e
#define TC7LO 0x005
#define PACTL 0x0060
   /* #  define PACTL_ 0x80 */
#  define PACTL_PAEN 0x40
#  define PACTL_PAMOD 0x20
#  define PACTL_PEDGE 0x10
#  define PACTL_CLK1 0x08
#  define PACTL_CLK0 0x04
#  define PACTL_PAOVI 0x02
#  define PACTL_PAIF 0x01
#define PAFLG 0x0061
   /* #  define PAFLG_ 0x80 */
   /* #  define PAFLG_ 0x40 */
   /* #  define PAFLG_ 0x20 */
   /* #  define PAFLG_ 0x10 */
   /* #  define PAFLG_ 0x08 */
   /* #  define PAFLG_ 0x04 */
#  define PAFLG_PAOVF 0x02
#  define PAFLG_PAIF 0x01
#define PACN3 0x0062
#define PACN2 0x0063
#define PACN1 0x0064
#define PACN0 0x0065
#define MCCTL 0x0066
#  define MCCTL_MCZI 0x80
#  define MCCTL_MODMC 0x40
#  define MCCTL_RDMCL 0x20
#  define MCCTL_ICLAT 0x10
#  define MCCTL_FLMC 0x08
#  define MCCTL_MCEN 0x04
#  define MCCTL_MCPR1 0x02
#  define MCCTL_MCPR0 0x01
#define MCFLG 0x0067
#  define MCFLG_MCZF 0x80
   /* #  define MCFLG_ 0x40 */
   /* #  define MCFLG_ 0x20 */
   /* #  define MCFLG_ 0x10 */
#  define MCFLG_POLF3 0x08
#  define MCFLG_POLF2 0x04
#  define MCFLG_POLF1 0x02
#  define MCFLG_POLF0 0x01
#define ICPAR 0x0068
   /* #  define ICPAR_ 0x80 */
   /* #  define ICPAR_ 0x40 */
   /* #  define ICPAR_ 0x20 */
   /* #  define ICPAR_ 0x10 */
#  define ICPAR_PA3EN 0x08
#  define ICPAR_PA2EN 0x04
#  define ICPAR_PA1EN 0x02
#  define ICPAR_PA0EN 0x01
#define DLYCT 0x0069
   /* #  define DLYCT_ 0x80 */
   /* #  define DLYCT_ 0x40 */
   /* #  define DLYCT_ 0x20 */
   /* #  define DLYCT_ 0x10 */
   /* #  define DLYCT_ 0x08 */
   /* #  define DLYCT_ 0x04 */
#  define DLYCT_DLY1 0x02
#  define DLYCT_DLY0 0x01
#define ICOVW 0x006a
#  define ICOVW_NOVW7 0x80
#  define ICOVW_NOVW6 0x40
#  define ICOVW_NOVW5 0x20
#  define ICOVW_NOVW4 0x10
#  define ICOVW_NOVW3 0x08
#  define ICOVW_NOVW2 0x04
#  define ICOVW_NOVW1 0x02
#  define ICOVW_NOVW0 0x01
#define ICSYS 0x006b
#  define ICSYS_SH37 0x80
#  define ICSYS_SH26 0x40
#  define ICSYS_SH15 0x20
#  define ICSYS_SH04 0x10
#  define ICSYS_TFMOD 0x08
#  define ICSYS_PACMX 0x04
#  define ICSYS_BUFEN 0x02
#  define ICSYS_LATQ 0x01
/* #define RESERVED_0x006c 0x006c */
#define TIMTST 0x006d /* test only */
   /* #  define TIMTST_ 0x80 */
   /* #  define TIMTST_ 0x40 */
   /* #  define TIMTST_ 0x20 */
   /* #  define TIMTST_ 0x10 */
   /* #  define TIMTST_ 0x08 */
   /* #  define TIMTST_ 0x04 */
#  define TIMTST_TCBYP 0x02
   /* #  define TIMTST_ 0x01 */
/* #define RESERVED_0x006e 0x006e */
/* #define RESERVED_0x006f 0x006f */
#define PBCTL 0x0070
   /* #  define PBCTL_ 0x80 */
#  define PBCTL_PBEN 0x40
   /* #  define PBCTL_ 0x20 */
   /* #  define PBCTL_ 0x10 */
   /* #  define PBCTL_ 0x08 */
   /* #  define PBCTL_ 0x04 */
#  define PBCTL_PBOVI 0x02
   /* #  define PBCTL_ 0x01 */
#define PBFLG 0x0071
   /* #  define PBFLG_ 0x80 */
   /* #  define PBFLG_ 0x40 */
   /* #  define PBFLG_ 0x20 */
   /* #  define PBFLG_ 0x10 */
   /* #  define PBFLG_ 0x08 */
   /* #  define PBFLG_ 0x04 */
#  define PBFLG_PBOVF 0x02
   /* #  define PBFLG_ 0x01 */
#define PA3H 0x0072
#define PA2H 0x0073
#define PA1H 0x0074
#define PA0H 0x0075
#define MCCNT 0x0076
#define MCCNTHI 0x0076
#define MCCNTLO 0x007
#define TC0H 0x0078
#define TC0HHI 0x0078
#define TC0HLO 0x007
#define TC1H 0x007a
#define TC1HHI 0x007a
#define TC1HLO 0x007
#define TC2H 0x007c
#define TC2HHI 0x007c
#define TC2HLO 0x007
#define TC3H 0x007e
#define TC3HHI 0x007e
#define TC3HLO 0x007

/* ATD0 */

#define ATD0CTL0 0x0080
#define ATD0CTL1 0x0081
#define ATD0CTL2 0x0082
#  define ATD0CTL2_ADPU 0x80
#  define ATD0CTL2_AFFC 0x40
#  define ATD0CTL2_AWAI 0x20
#  define ATD0CTL2_ETRIGLE 0x10
#  define ATD0CTL2_ETRIGP 0x08
#  define ATD0CTL2_ETRIG 0x04
#  define ATD0CTL2_ASCIE 0x02
#  define ATD0CTL2_ASCIF 0x01
#define ATD0CTL3 0x0083
   /* #  define ATD0CTL3_ 0x80 */
#  define ATD0CTL3_S8C 0x40
#  define ATD0CTL3_S4C 0x20
#  define ATD0CTL3_S2C 0x10
#  define ATD0CTL3_S1C 0x08
#  define ATD0CTL3_FIFO 0x04
#  define ATD0CTL3_FRZ1 0x02
#  define ATD0CTL3_FRZ0 0x01
#define ATD0CTL4 0x0084
#  define ATD0CTL4_SRES8 0x80
#  define ATD0CTL4_SMP1 0x40
#  define ATD0CTL4_SMP0 0x20
#  define ATD0CTL4_PRS4 0x10
#  define ATD0CTL4_PRS3 0x08
#  define ATD0CTL4_PRS2 0x04
#  define ATD0CTL4_PRS1 0x02
#  define ATD0CTL4_PRS0 0x01
#define ATD0CTL5 0x0085
#  define ATD0CTL5_DJM 0x80
#  define ATD0CTL5_DSGN 0x40
#  define ATD0CTL5_SCAN 0x20
#  define ATD0CTL5_MULT 0x10
   /* #  define ATD0CTL5_ 0x08 */
#  define ATD0CTL5_CC 0x04
#  define ATD0CTL5_CB 0x02
#  define ATD0CTL5_CA 0x01
#define ATD0STAT0 0x0086
#  define ATD0STAT0_SCF 0x80
   /* #  define ATD0STAT0_ 0x40 */
#  define ATD0STAT0_ETORF 0x20
#  define ATD0STAT0_FIFOR 0x10
   /* #  define ATD0STAT0_ 0x08 */
#  define ATD0STAT0_CC2 0x04
#  define ATD0STAT0_CC1 0x02
#  define ATD0STAT0_CC0 0x01
/* #define RESERVED_0x0087 0x0087 */
#define ATD0TEST0 0x0088
#define ATD0TEST1 0x0089
#  define ATD0TEST1_SC 0x01
/* #define RESERVED_0x008a 0x008a */
#define ATD0STAT1 0x008b
#  define ATD0STAT1_CCF7 0x80
#  define ATD0STAT1_CCF6 0x40
#  define ATD0STAT1_CCF5 0x20
#  define ATD0STAT1_CCF4 0x10
#  define ATD0STAT1_CCF3 0x08
#  define ATD0STAT1_CCF2 0x04
#  define ATD0STAT1_CCF1 0x02
#  define ATD0STAT1_CCF0 0x01
/* #define RESERVED_0x008c 0x008c */
#define ATD0DIEN 0x008d
/* #define RESERVED_0x008e 0x008e */
#define PORTAD0 0x008f
#  define PORTAD0_BIT7 0x80
#  define PORTAD0_BIT6 0x40
#  define PORTAD0_BIT5 0x20
#  define PORTAD0_BIT4 0x10
#  define PORTAD0_BIT3 0x08
#  define PORTAD0_BIT2 0x04
#  define PORTAD0_BIT1 0x02
#  define PORTAD0_BIT0 0x01
#define ATD0DR0H 0x0090
#define ATD0DR0L 0x0091
#define ATD0DR1H 0x0092
#define ATD0DR1L 0x0093
#define ATD0DR2H 0x0094
#define ATD0DR2L 0x0095
#define ATD0DR3H 0x0096
#define ATD0DR3L 0x0097
#define ATD0DR4H 0x0098
#define ATD0DR4L 0x0099
#define ATD0DR5H 0x009a
#define ATD0DR5L 0x009b
#define ATD0DR6H 0x009c
#define ATD0DR6L 0x009d
#define ATD0DR7H 0x009e
#define ATD0DR7L 0x009f

/* PWM */

#define PWME 0x00a0
#  define PWME_PWME7 0x80
#  define PWME_PWME6 0x40
#  define PWME_PWME5 0x20
#  define PWME_PWME4 0x10
#  define PWME_PWME3 0x08
#  define PWME_PWME2 0x04
#  define PWME_PWME1 0x02
#  define PWME_PWME0 0x01
#define PWMPOL 0x00a1
#  define PWMPOL_PPOL7 0x80
#  define PWMPOL_PPOL6 0x40
#  define PWMPOL_PPOL5 0x20
#  define PWMPOL_PPOL4 0x10
#  define PWMPOL_PPOL3 0x08
#  define PWMPOL_PPOL2 0x04
#  define PWMPOL_PPOL1 0x02
#  define PWMPOL_PPOL0 0x01
#define PWMCLK 0x00a2
#  define PWMCLK_PCLK7 0x80
#  define PWMCLK_PCLK6 0x40
#  define PWMCLK_PCLK5 0x20
#  define PWMCLK_PCLK4 0x10
#  define PWMCLK_PCLK3 0x08
#  define PWMCLK_PCLK2 0x04
#  define PWMCLK_PCLK1 0x02
#  define PWMCLK_PCLK0 0x01
#define PWMPRCLK 0x00a3
   /* #  define PWMPRCLK_ 0x80 */
#  define PWMPRCLK_PCKB2 0x40
#  define PWMPRCLK_PCKB1 0x20
#  define PWMPRCLK_PCKB0 0x10
   /* #  define PWMPRCLK_ 0x08 */
#  define PWMPRCLK_PCKA2 0x04
#  define PWMPRCLK_PCKA1 0x02
#  define PWMPRCLK_PCKA0 0x01
#define PWMCAE 0x00a4
#  define PWMCAE_CAE7 0x80
#  define PWMCAE_CAE6 0x40
#  define PWMCAE_CAE5 0x20
#  define PWMCAE_CAE4 0x10
#  define PWMCAE_CAE3 0x08
#  define PWMCAE_CAE2 0x04
#  define PWMCAE_CAE1 0x02
#  define PWMCAE_CAE0 0x01
#define PWMCTL 0x00a5
#  define PWMCTL_CON67 0x80
#  define PWMCTL_CON45 0x40
#  define PWMCTL_CON23 0x20
#  define PWMCTL_CON01 0x10
#  define PWMCTL_PSWAI 0x08
#  define PWMCTL_PFRZ 0x04
   /* #  define PWMCTL_ 0x02 */
   /* #  define PWMCTL_ 0x01 */
#define PWMTST 0x00a6 /* test only */
#define PWMPRSC 0x00a7 /* test only */
#define PWMSCLA 0x00a8
#define PWMSCLB 0x00a9
#define PWMSCNTA 0x00aa
#define PWMSCNTB 0x00ab
#define PWMCNT0 0x00ac
#define PWMCNT1 0x00ad
#define PWMCNT2 0x00ae
#define PWMCNT3 0x00af
#define PWMCNT4 0x00b0
#define PWMCNT5 0x00b1
#define PWMCNT6 0x00b2
#define PWMCNT7 0x00b3
#define PWMPER0 0x00b4
#define PWMPER1 0x00b5
#define PWMPER2 0x00b6
#define PWMPER3 0x00b7
#define PWMPER4 0x00b8
#define PWMPER5 0x00b9
#define PWMPER6 0x00ba
#define PWMPER7 0x00bb
#define PWMDTY0 0x00bc
#define PWMDTY1 0x00bd
#define PWMDTY2 0x00be
#define PWMDTY3 0x00bf

#define PWMDTY4 0x00c0
#define PWMDTY5 0x00c1
#define PWMDTY6 0x00c2
#define PWMDTY7 0x00c3
#define PWMSDN 0x00c4
#  define PWMSDN_PWMIF 0x80
#  define PWMSDN_PWMIE 0x40
#  define PWMSDN_PWMRSTRT 0x20
#  define PWMSDN_PWMLVL 0x10
   /* #  define PWMSDN_ 0x08 */
#  define PWMSDN_PWM7IN 0x04
#  define PWMSDN_PWM7INL 0x02
#  define PWMSDN_PWM7ENA 0x01
/* #define RESERVED_0x00c5 0x00c5 */
/* #define RESERVED_0x00c6 0x00c6 */
/* #define RESERVED_0x00c7 0x00c7 */

