george-hopkins/hcs12mem/target/io_mc9s12a64.h
/* SCI0 */

#define SCI0BD  0x00c8
#define SCI0BDH 0x00c8
   /* #  define SCI0BDH_ 0x80 */
   /* #  define SCI0BDH_ 0x40 */
   /* #  define SCI0BDH_ 0x20 */
#  define SCI0BDH_SBR12 0x10
#  define SCI0BDH_SBR11 0x08
#  define SCI0BDH_SBR10 0x04
#  define SCI0BDH_SBR9 0x02
#  define SCI0BDH_SBR8 0x01
#define SCI0BDL 0x00c9
#  define SCI0BDL_SBR7 0x80
#  define SCI0BDL_SBR6 0x40
#  define SCI0BDL_SBR5 0x20
#  define SCI0BDL_SBR4 0x10
#  define SCI0BDL_SBR3 0x08
#  define SCI0BDL_SBR2 0x04
#  define SCI0BDL_SBR1 0x02
#  define SCI0BDL_SBR0 0x01
#define SCI0CR1 0x00ca
#  define SCI0CR1_LOOPS 0x80
#  define SCI0CR1_SCISWAI 0x40
#  define SCI0CR1_RSRC 0x20
#  define SCI0CR1_M 0x10
#  define SCI0CR1_WAKE 0x08
#  define SCI0CR1_ILT 0x04
#  define SCI0CR1_PE 0x02
#  define SCI0CR1_PT 0x01
#define SCI0CR2 0x00cb
#  define SCI0CR2_TIE 0x80
#  define SCI0CR2_TCIE 0x40
#  define SCI0CR2_RIE 0x20
#  define SCI0CR2_ILIE 0x10
#  define SCI0CR2_TE 0x08
#  define SCI0CR2_RE 0x04
#  define SCI0CR2_RWU 0x02
#  define SCI0CR2_SBK 0x01
#define SCI0SR1 0x00cc
#  define SCI0SR1_TDRE 0x80
#  define SCI0SR1_TC 0x40
#  define SCI0SR1_RDRF 0x20
#  define SCI0SR1_IDLE 0x10
#  define SCI0SR1_OR 0x08
#  define SCI0SR1_NF 0x04
#  define SCI0SR1_FE 0x02
#  define SCI0SR1_PF 0x01
#define SCI0SR2 0x00cd
   /* #  define SCI0SR2_ 0x80 */
   /* #  define SCI0SR2_ 0x40 */
   /* #  define SCI0SR2_ 0x20 */
   /* #  define SCI0SR2_ 0x10 */
   /* #  define SCI0SR2_ 0x08 */
#  define SCI0SR2_BRK13 0x04
#  define SCI0SR2_TXDIR 0x02
#  define SCI0SR2_RAF 0x01
#define SCI0DRH 0x00ce
#  define SCI0DRH_R8 0x80
#  define SCI0DRH_T8 0x40
   /* #  define SCI0DRH_ 0x20 */
   /* #  define SCI0DRH_ 0x10 */
   /* #  define SCI0DRH_ 0x08 */
   /* #  define SCI0DRH_ 0x04 */
   /* #  define SCI0DRH_ 0x02 */
   /* #  define SCI0DRH_ 0x01 */
#define SCI0DRL 0x00cf
#  define SCI0DRL_R7_T7 0x80
#  define SCI0DRL_R6_T6 0x40
#  define SCI0DRL_R5_T5 0x20
#  define SCI0DRL_R4_T4 0x10
#  define SCI0DRL_R3_T3 0x08
#  define SCI0DRL_R2_T2 0x04
#  define SCI0DRL_R1_T1 0x02
#  define SCI0DRL_R0_T0 0x01

/* SCI1 */

#define SCI1BD  0x00d0
#define SCI1BDH 0x00d0
   /* #  define SCI1BDH_ 0x80 */
   /* #  define SCI1BDH_ 0x40 */
   /* #  define SCI1BDH_ 0x20 */
#  define SCI1BDH_SBR12 0x10
#  define SCI1BDH_SBR11 0x08
#  define SCI1BDH_SBR10 0x04
#  define SCI1BDH_SBR9 0x02
#  define SCI1BDH_SBR8 0x01
#define SCI1BDL 0x00d1
#  define SCI1BDL_SBR7 0x80
#  define SCI1BDL_SBR6 0x40
#  define SCI1BDL_SBR5 0x20
#  define SCI1BDL_SBR4 0x10
#  define SCI1BDL_SBR3 0x08
#  define SCI1BDL_SBR2 0x04
#  define SCI1BDL_SBR1 0x02
#  define SCI1BDL_SBR0 0x01
#define SCI1CR1 0x00d2
#  define SCI1CR1_LOOPS 0x80
#  define SCI1CR1_SCISWAI 0x40
#  define SCI1CR1_RSRC 0x20
#  define SCI1CR1_M 0x10
#  define SCI1CR1_WAKE 0x08
#  define SCI1CR1_ILT 0x04
#  define SCI1CR1_PE 0x02
#  define SCI1CR1_PT 0x01
#define SCI1CR2 0x00d3
#  define SCI1CR2_TIE 0x80
#  define SCI1CR2_TCIE 0x40
#  define SCI1CR2_RIE 0x20
#  define SCI1CR2_ILIE 0x10
#  define SCI1CR2_TE 0x08
#  define SCI1CR2_RE 0x04
#  define SCI1CR2_RWU 0x02
#  define SCI1CR2_SBK 0x01
#define SCI1SR1 0x00d4
#  define SCI1SR1_TDRE 0x80
#  define SCI1SR1_TC 0x40
#  define SCI1SR1_RDRF 0x20
#  define SCI1SR1_IDLE 0x10
#  define SCI1SR1_OR 0x08
#  define SCI1SR1_NF 0x04
#  define SCI1SR1_FE 0x02
#  define SCI1SR1_PF 0x01
#define SCI1SR2 0x00d5
   /* #  define SCI1SR2_ 0x80 */
   /* #  define SCI1SR2_ 0x40 */
   /* #  define SCI1SR2_ 0x20 */
   /* #  define SCI1SR2_ 0x10 */
   /* #  define SCI1SR2_ 0x08 */
#  define SCI1SR2_BRK13 0x04
#  define SCI1SR2_TXDIR 0x02
#  define SCI1SR2_RAF 0x01
#define SCI1DRH 0x00d6
#  define SCI1DRH_R8 0x80
#  define SCI1DRH_T8 0x40
   /* #  define SCI1DRH_ 0x20 */
   /* #  define SCI1DRH_ 0x10 */
   /* #  define SCI1DRH_ 0x08 */
   /* #  define SCI1DRH_ 0x04 */
   /* #  define SCI1DRH_ 0x02 */
   /* #  define SCI1DRH_ 0x01 */
#define SCI1DRL 0x00d7
#  define SCI1DRL_R7_T7 0x80
#  define SCI1DRL_R6_T6 0x40
#  define SCI1DRL_R5_T5 0x20
#  define SCI1DRL_R4_T4 0x10
#  define SCI1DRL_R3_T3 0x08
#  define SCI1DRL_R2_T2 0x04
#  define SCI1DRL_R1_T1 0x02
#  define SCI1DRL_R0_T0 0x01

/* SPI0 */

#define SPI0CR1 0x00d8
#  define SPI0CR1_SPIE 0x80
#  define SPI0CR1_SPE 0x40
#  define SPI0CR1_SPTIE 0x20
#  define SPI0CR1_MSTR 0x10
#  define SPI0CR1_CPOL 0x08
#  define SPI0CR1_CPHA 0x04
#  define SPI0CR1_SSOE 0x02
#  define SPI0CR1_LSBFE 0x01
#define SPI0CR2 0x00d9
   /* #  define SPI0CR2_ 0x80 */
   /* #  define SPI0CR2_ 0x40 */
   /* #  define SPI0CR2_ 0x20 */
#  define SPI0CR2_MODFEN 0x10
#  define SPI0CR2_BIDIROE 0x08
   /* #  define SPI0CR2_ 0x04 */
#  define SPI0CR2_SPISWAI 0x02
#  define SPI0CR2_SPC0 0x01
#define SPI0BR 0x00da
   /* #  define SPI0BR_ 0x80 */
#  define SPI0BR_SPPR2 0x40
#  define SPI0BR_SPPR1 0x20
#  define SPI0BR_SPPR0 0x10
   /* #  define SPI0BR_ 0x08 */
#  define SPI0BR_SPR2 0x04
#  define SPI0BR_SPR1 0x02
#  define SPI0BR_SPR0 0x01
#define SPI0SR 0x00db
#  define SPI0SR_SPIF 0x80
   /* #  define SPI0SR_ 0x40 */
#  define SPI0SR_SPTEF 0x20
#  define SPI0SR_MODF 0x10
   /* #  define SPI0SR_ 0x08 */
   /* #  define SPI0SR_ 0x04 */
   /* #  define SPI0SR_ 0x02 */
   /* #  define SPI0SR_ 0x01 */
/* #define RESERVED_0x00dc 0x00dc */
#define SPI0DR 0x00dd
/* #define RESERVED_0x00de 0x00de */
/* #define RESERVED_0x00df 0x00df */

/* IIC */

#define IBAD 0x00e0
#  define IBAD_ADR7 0x80
#  define IBAD_ADR6 0x40
#  define IBAD_ADR5 0x20
#  define IBAD_ADR4 0x10
#  define IBAD_ADR3 0x08
#  define IBAD_ADR2 0x04
#  define IBAD_ADR1 0x02
   /* #  define IBAD_ 0x01 */
#define IBFD 0x00e1
#  define IBFD_IBC7 0x80
#  define IBFD_IBC6 0x40
#  define IBFD_IBC5 0x20
#  define IBFD_IBC4 0x10
#  define IBFD_IBC3 0x08
#  define IBFD_IBC2 0x04
#  define IBFD_IBC1 0x02
#  define IBFD_IBC0 0x01
#define IBCR 0x00e2
#  define IBCR_IBEN 0x80
#  define IBCR_IBIE 0x40
#  define IBCR_MSSL 0x20
#  define IBCR_TXRX 0x10
#  define IBCR_TXAK 0x08
#  define IBCR_RSTA 0x04
   /* #  define IBCR_ 0x02 */
#  define IBCR_IBSWAI 0x01
#define IBSR 0x00e3
#  define IBSR_TCF 0x80
#  define IBSR_IAAS 0x40
#  define IBSR_IBB 0x20
#  define IBSR_IBAL 0x10
   /* #  define IBSR_ 0x08 */
#  define IBSR_SRW 0x04
#  define IBSR_IBIF 0x02
#  define IBSR_RXAK 0x01
#define IBDR 0x00e4
/* #define RESERVED_0x00e5 0x00e5 */
/* #define RESERVED_0x00e6 0x00e6 */
/* #define RESERVED_0x00e7 0x00e7 */

