george-hopkins/hcs12mem/target/io_mc9s12a64.h
/* BDLC */

#define DLCBCR1 0x00e8
#  define DLCBCR1_IMSG 0x80
#  define DLCBCR1_CLKS 0x40
   /* #  define DLCBCR1_ 0x20 */
   /* #  define DLCBCR1_ 0x10 */
   /* #  define DLCBCR1_ 0x08 */
   /* #  define DLCBCR1_ 0x04 */
#  define DLCBCR1_IE 0x02
#  define DLCBCR1_WCM 0x01
#define DLCBSVR 0x00e9
   /* #  define DLCBSVR_ 0x80 */
   /* #  define DLCBSVR_ 0x40 */
#  define DLCBSVR_I3 0x20
#  define DLCBSVR_I2 0x10
#  define DLCBSVR_I1 0x08
#  define DLCBSVR_I0 0x04
   /* #  define DLCBSVR_ 0x02 */
   /* #  define DLCBSVR_ 0x01 */
#define DLCBCR2 0x00ea
#  define DLCBCR2_SMRST 0x80
#  define DLCBCR2_DLOOP 0x40
#  define DLCBCR2_RX4XE 0x20
#  define DLCBCR2_NBFS 0x10
#  define DLCBCR2_TEOD 0x08
#  define DLCBCR2_TSIFR 0x04
#  define DLCBCR2_TMIFR1 0x02
#  define DLCBCR2_TMIFR0 0x01
#define DLCBDR  0x00eb
#  define DLCBDR_D7 0x80
#  define DLCBDR_D6 0x40
#  define DLCBDR_D5 0x20
#  define DLCBDR_D4 0x10
#  define DLCBDR_D3 0x08
#  define DLCBDR_D2 0x04
#  define DLCBDR_D1 0x02
#  define DLCBDR_D0 0x01
#define DLCBARD 0x00ec
   /* #  define DLCBARD_ 0x80 */
#  define DLCBARD_RXPOL 0x40
   /* #  define DLCBARD_ 0x20 */
   /* #  define DLCBARD_ 0x10 */
#  define DLCBARD_BO3 0x08
#  define DLCBARD_BO2 0x04
#  define DLCBARD_BO1 0x02
#  define DLCBARD_BO0 0x01
#define DLCBRSR 0x00ed
   /* #  define DLCBRSR_ 0x80 */
   /* #  define DLCBRSR_ 0x40 */
#  define DLCBRSR_R5 0x20
#  define DLCBRSR_R4 0x10
#  define DLCBRSR_R3 0x08
#  define DLCBRSR_R2 0x04
#  define DLCBRSR_R1 0x02
#  define DLCBRSR_R0 0x01
#define DLCSCR  0x00ee
   /* #  define DLCSCR_ 0x80 */
   /* #  define DLCSCR_ 0x40 */
   /* #  define DLCSCR_ 0x20 */
#  define DLCSCR_BDLCE 0x10
   /* #  define DLCSCR_ 0x08 */
   /* #  define DLCSCR_ 0x04 */
   /* #  define DLCSCR_ 0x02 */
   /* #  define DLCSCR_ 0x01 */
#define DLCBSTAT 0x00ef
   /* #  define DLCBSTAT_ 0x80 */
   /* #  define DLCBSTAT_ 0x40 */
   /* #  define DLCBSTAT_ 0x20 */
   /* #  define DLCBSTAT_ 0x10 */
   /* #  define DLCBSTAT_ 0x08 */
   /* #  define DLCBSTAT_ 0x04 */
   /* #  define DLCBSTAT_ 0x02 */
#  define DLCBSTAT_IDLE 0x01

/* reserved 0x00f0..0x00ff */

/* FLASH */

#define FCLKDIV 0x0100
#  define FCLKDIV_FDIVLD 0x80
#  define FCLKDIV_PRDIV8 0x40
#  define FCLKDIV_FDIV5 0x20
#  define FCLKDIV_FDIV4 0x10
#  define FCLKDIV_FDIV3 0x08
#  define FCLKDIV_FDIV2 0x04
#  define FCLKDIV_FDIV1 0x02
#  define FCLKDIV_FDIV0 0x01
#define FSEC 0x0101
#  define FSEC_KEYEN 0x80
#  define FSEC_NV6 0x40
#  define FSEC_NV5 0x20
#  define FSEC_NV4 0x10
#  define FSEC_NV3 0x08
#  define FSEC_NV2 0x04
#  define FSEC_SEC1 0x02
#  define FSEC_SEC0 0x01
/* #define RESERVED_0x0102 0x0102 */
#define FCNFG 0x0103
#  define FCNFG_CBEIE 0x80
#  define FCNFG_CCIE 0x40
#  define FCNFG_KEYACC 0x20
   /* #  define FCNFG_ 0x10 */
   /* #  define FCNFG_ 0x08 */
   /* #  define FCNFG_ 0x04 */
   /* #  define FCNFG_ 0x02 */
   /* #  define FCNFG_ 0x01 */
#define FPROT 0x0104
#  define FPROT_FPOPEN 0x80
#  define FPROT_NV6 0x40
#  define FPROT_FPHDIS 0x20
#  define FPROT_FPHS1 0x10
#  define FPROT_FPHS0 0x08
#  define FPROT_FPLDIS 0x04
#  define FPROT_FPLS1 0x02
#  define FPROT_FPLS0 0x01
#define FSTAT 0x0105
#  define FSTAT_CBEIF 0x80
#  define FSTAT_CCIF 0x40
#  define FSTAT_PVIOL 0x20
#  define FSTAT_ACCERR 0x10
   /* #  define FSTAT_ 0x08 */
#  define FSTAT_BLANK 0x04
   /* #  define FSTAT_ 0x02 */
   /* #  define FSTAT_ 0x01 */
#define FCMD 0x0106
   /* #  define FCMD_ 0x80 */
#  define FCMD_CMDB6 0x40
#  define FCMD_CMDB5 0x20
   /* #  define FCMD_ 0x10 */
   /* #  define FCMD_ 0x08 */
#  define FCMD_CMDB2 0x04
   /* #  define FCMD_ 0x02 */
#  define FCMD_CMDB0 0x01
/* #define RESERVED_0x0107 0x0107 */
#define FADDR 0x0108
#define FADDRHI 0x0108
#define FADDRLO 0x0109
#define FDATA 0x010a
#define FDATAHI 0x010a
#define FDATALO 0x010b
/* #define RESERVED_0x010c 0x010c */
/* #define RESERVED_0x010d 0x010d */
/* #define RESERVED_0x010e 0x010e */
/* #define RESERVED_0x010f 0x010f */

/* EEPROM */

#define ECLKDIV 0x0110
#  define ECLKDIV_EDIVLD 0x80
#  define ECLKDIV_PRDIV8 0x40
#  define ECLKDIV_EDIV5 0x20
#  define ECLKDIV_EDIV4 0x10
#  define ECLKDIV_EDIV3 0x08
#  define ECLKDIV_EDIV2 0x04
#  define ECLKDIV_EDIV1 0x02
#  define ECLKDIV_EDIV0 0x01
/* #define RESERVED_0x0111 0x0111 */
/* #define RESERVED_0x0112 0x0112 */
#define ECNFG 0x0113
#  define ECNFG_CBEIE 0x80
#  define ECNFG_CCIE 0x40
   /* #  define ECNFG_ 0x20 */
   /* #  define ECNFG_ 0x10 */
   /* #  define ECNFG_ 0x08 */
   /* #  define ECNFG_ 0x04 */
   /* #  define ECNFG_ 0x02 */
   /* #  define ECNFG_ 0x01 */
#define EPROT 0x0114
#  define EPROT_EPOPEN 0x80
#  define EPROT_NV6 0x40
#  define EPROT_NV5 0x20
#  define EPROT_NV4 0x10
#  define EPROT_EPDIS 0x08
#  define EPROT_EP2 0x04
#  define EPROT_EP1 0x02
#  define EPROT_EP0 0x01
#define ESTAT 0x0115
#  define ESTAT_CBEIF 0x80
#  define ESTAT_CCIF 0x40
#  define ESTAT_PVIOL 0x20
#  define ESTAT_ACCERR 0x10
   /* #  define ESTAT_ 0x08 */
#  define ESTAT_BLANK 0x04
   /* #  define ESTAT_ 0x02 */
   /* #  define ESTAT_ 0x01 */
#define ECMD 0x0116
   /* #  define ECMD_ 0x80 */
#  define ECMD_CMDB6 0x40
#  define ECMD_CMDB5 0x20
   /* #  define ECMD_ 0x10 */
   /* #  define ECMD_ 0x08 */
#  define ECMD_CMDB2 0x04
   /* #  define ECMD_ 0x02 */
#  define ECMD_CMDB0 0x01
/* #define RESERVED_0x0117 0x0117 */
#define EADDR 0x0118
#define EADDRHI 0x0118
#define EADDRLO 0x0119
#define EDATA 0x011a
#define EDATAHI 0x011a
#define EDATALO 0x011b
/* #define RESERVED_0x011c 0x011c */
/* #define RESERVED_0x011d 0x011d */
/* #define RESERVED_0x011e 0x011e */
/* #define RESERVED_0x011f 0x011f */

/* ATD1 */

#define ATD1CTL0 0x0120
#define ATD1CTL1 0x0121
#define ATD1CTL2 0x0122
#  define ATD1CTL2_ADPU 0x80
#  define ATD1CTL2_AFFC 0x40
#  define ATD1CTL2_AWAI 0x20
#  define ATD1CTL2_ETRIGLE 0x10
#  define ATD1CTL2_ETRIGP 0x08
#  define ATD1CTL2_ETRIG 0x04
#  define ATD1CTL2_ASCIE 0x02
#  define ATD1CTL2_ASCIF 0x01
#define ATD1CTL3 0x0123
   /* #  define ATD1CTL3_ 0x80 */
#  define ATD1CTL3_S8C 0x40
#  define ATD1CTL3_S4C 0x20
#  define ATD1CTL3_S2C 0x10
#  define ATD1CTL3_S1C 0x08
#  define ATD1CTL3_FIFO 0x04
#  define ATD1CTL3_FRZ1 0x02
#  define ATD1CTL3_FRZ0 0x01
#define ATD1CTL4 0x0124
#  define ATD1CTL4_SRES8 0x80
#  define ATD1CTL4_SMP1 0x40
#  define ATD1CTL4_SMP0 0x20
#  define ATD1CTL4_PRS4 0x10
#  define ATD1CTL4_PRS3 0x08
#  define ATD1CTL4_PRS2 0x04
#  define ATD1CTL4_PRS1 0x02
#  define ATD1CTL4_PRS0 0x01
#define ATD1CTL5 0x0125
#  define ATD1CTL5_DJM 0x80
#  define ATD1CTL5_DSGN 0x40
#  define ATD1CTL5_SCAN 0x20
#  define ATD1CTL5_MULT 0x10
   /* #  define ATD1CTL5_ 0x08 */
#  define ATD1CTL5_CC 0x04
#  define ATD1CTL5_CB 0x02
#  define ATD1CTL5_CA 0x01
#define ATD1STAT0 0x0126
#  define ATD1STAT0_SCF 0x80
   /* #  define ATD1STAT0_ 0x40 */
#  define ATD1STAT0_ETORF 0x20
#  define ATD1STAT0_FIFOR 0x10
   /* #  define ATD1STAT0_ 0x08 */
#  define ATD1STAT0_CC2 0x04
#  define ATD1STAT0_CC1 0x02
#  define ATD1STAT0_CC0 0x01
/* #define RESERVED_0x0127 0x0127 */
#define ATD1TEST0 0x0128
#define ATD1TEST1 0x0129
#  define ATD1TEST1_SC 0x01
/* #define RESERVED_0x012a 0x012a */
#define ATD1STAT1 0x012b
#  define ATD1STAT1_CCF7 0x80
#  define ATD1STAT1_CCF6 0x40
#  define ATD1STAT1_CCF5 0x20
#  define ATD1STAT1_CCF4 0x10
#  define ATD1STAT1_CCF3 0x08
#  define ATD1STAT1_CCF2 0x04
#  define ATD1STAT1_CCF1 0x02
#  define ATD1STAT1_CCF0 0x01
/* #define RESERVED_0x012c 0x012c */
#define ATD1DIEN 0x012d
/* #define RESERVED_0x012e 0x012e */
#define PORTAD1 0x012f
#  define PORTAD1_BIT7 0x80
#  define PORTAD1_BIT6 0x40
#  define PORTAD1_BIT5 0x20
#  define PORTAD1_BIT4 0x10
#  define PORTAD1_BIT3 0x08
#  define PORTAD1_BIT2 0x04
#  define PORTAD1_BIT1 0x02
#  define PORTAD1_BIT0 0x01
#define ATD1DR0H 0x0130
#define ATD1DR0L 0x0131
#define ATD1DR1H 0x0132
#define ATD1DR1L 0x0133
#define ATD1DR2H 0x0134
#define ATD1DR2L 0x0135
#define ATD1DR3H 0x0136
#define ATD1DR3L 0x0137
#define ATD1DR4H 0x0138
#define ATD1DR4L 0x0139
#define ATD1DR5H 0x013a
#define ATD1DR5L 0x013b
#define ATD1DR6H 0x013c
#define ATD1DR6L 0x013d
#define ATD1DR7H 0x013e
#define ATD1DR7L 0x013f

/* CAN0 */

#define CAN0CTL0 0x0140
#define CAN0CTL1 0x0141
#define CAN0BTR0 0x0142
#define CAN0BTR1 0x0143
#define CAN0RFLG 0x0144
#define CAN0RIER 0x0145
#define CAN0TFLG 0x0146
#define CAN0TIER 0x0147
#define CAN0TARQ 0x0148
#define CAN0TAAK 0x0149
#define CAN0TBSEL 0x014a
#define CAN0IDAC 0x014b
/* #define  0x014c */
/* #define  0x014d */
#define CAN0RXERR 0x014e
#define CAN0TXERR 0x014f
#define CAN0IDAR0 0x0150
#define CAN0IDAR1 0x0151
#define CAN0IDAR2 0x0152
#define CAN0IDAR3 0x0153
#define CAN0IDMR0 0x0154
#define CAN0IDMR1 0x0155
#define CAN0IDMR2 0x0156
#define CAN0IDMR3 0x0157
#define CAN0IDAR4 0x0158
#define CAN0IDAR5 0x0159
#define CAN0IDAR6 0x015a
#define CAN0IDAR7 0x015b
#define CAN0IDMR4 0x015c
#define CAN0IDMR5 0x015d
#define CAN0IDMR6 0x015e
#define CAN0IDMR7 0x015f
#define CAN0RXFG 0x0160 /* 0x0160..0x016f */
#define CAN0TXFG 0x0170 /* 0x0170..0x017f */

