george-hopkins/hcs12mem/target/io_mc9s12a64.h
/* reserved: 0x0180..0x23f */

/* PIM */

#define PTT 0x0240
#  define PTT_PTT7 0x80
#  define PTT_PTT6 0x40
#  define PTT_PTT5 0x20
#  define PTT_PTT4 0x10
#  define PTT_PTT3 0x08
#  define PTT_PTT2 0x04
#  define PTT_PTT1 0x02
#  define PTT_PTT0 0x01
#define PTIT 0x0241
#  define PTIT_PTIT7 0x80
#  define PTIT_PTIT6 0x40
#  define PTIT_PTIT5 0x20
#  define PTIT_PTIT4 0x10
#  define PTIT_PTIT3 0x08
#  define PTIT_PTIT2 0x04
#  define PTIT_PTIT1 0x02
#  define PTIT_PTIT0 0x01
#define DDRT 0x0242
#  define DDRT_DDRT7 0x80
#  define DDRT_DDRT6 0x40
#  define DDRT_DDRT5 0x20
#  define DDRT_DDRT4 0x10
#  define DDRT_DDRT3 0x08
#  define DDRT_DDRT2 0x04
#  define DDRT_DDRT1 0x02
#  define DDRT_DDRT0 0x01
#define RDRT 0x0243
#  define RDRT_RDRT7 0x80
#  define RDRT_RDRT6 0x40
#  define RDRT_RDRT5 0x20
#  define RDRT_RDRT4 0x10
#  define RDRT_RDRT3 0x08
#  define RDRT_RDRT2 0x04
#  define RDRT_RDRT1 0x02
#  define RDRT_RDRT0 0x01
#define PERT 0x0244
#  define PERT_PERT7 0x80
#  define PERT_PERT6 0x40
#  define PERT_PERT5 0x20
#  define PERT_PERT4 0x10
#  define PERT_PERT3 0x08
#  define PERT_PERT2 0x04
#  define PERT_PERT1 0x02
#  define PERT_PERT0 0x01
#define PPST 0x0245
#  define PPST_PPST7 0x80
#  define PPST_PPST6 0x40
#  define PPST_PPST5 0x20
#  define PPST_PPST4 0x10
#  define PPST_PPST3 0x08
#  define PPST_PPST2 0x04
#  define PPST_PPST1 0x02
#  define PPST_PPST0 0x01
/* #define RESERVED_0x0246 0x0246 */
/* #define RESERVED_0x0247 0x0247 */
#define PTS 0x0248
#  define PTS_PTS7 0x80
#  define PTS_PTS6 0x40
#  define PTS_PTS5 0x20
#  define PTS_PTS4 0x10
#  define PTS_PTS3 0x08
#  define PTS_PTS2 0x04
#  define PTS_PTS1 0x02
#  define PTS_PTS0 0x01
#define PTIS 0x0249
#  define PTIS_PTIS7 0x80
#  define PTIS_PTIS6 0x40
#  define PTIS_PTIS5 0x20
#  define PTIS_PTIS4 0x10
#  define PTIS_PTIS3 0x08
#  define PTIS_PTIS2 0x04
#  define PTIS_PTIS1 0x02
#  define PTIS_PTIS0 0x01
#define DDRS 0x024a
#  define DDRS_DDRS7 0x80
#  define DDRS_DDRS6 0x40
#  define DDRS_DDRS5 0x20
#  define DDRS_DDRS4 0x10
#  define DDRS_DDRS3 0x08
#  define DDRS_DDRS2 0x04
#  define DDRS_DDRS1 0x02
#  define DDRS_DDRS0 0x01
#define RDRS 0x024b
#  define RDRS_RDRS7 0x80
#  define RDRS_RDRS6 0x40
#  define RDRS_RDRS5 0x20
#  define RDRS_RDRS4 0x10
#  define RDRS_RDRS3 0x08
#  define RDRS_RDRS2 0x04
#  define RDRS_RDRS1 0x02
#  define RDRS_RDRS0 0x01
#define PERS 0x024c
#  define PERS_PERS7 0x80
#  define PERS_PERS6 0x40
#  define PERS_PERS5 0x20
#  define PERS_PERS4 0x10
#  define PERS_PERS3 0x08
#  define PERS_PERS2 0x04
#  define PERS_PERS1 0x02
#  define PERS_PERS0 0x01
#define PPSS 0x024d
#  define PPSS_PPSS7 0x80
#  define PPSS_PPSS6 0x40
#  define PPSS_PPSS5 0x20
#  define PPSS_PPSS4 0x10
#  define PPSS_PPSS3 0x08
#  define PPSS_PPSS2 0x04
#  define PPSS_PPSS1 0x02
#  define PPSS_PPSS0 0x01
#define WOMS 0x024e
#  define WOMS_WOMS7 0x80
#  define WOMS_WOMS6 0x40
#  define WOMS_WOMS5 0x20
#  define WOMS_WOMS4 0x10
#  define WOMS_WOMS3 0x08
#  define WOMS_WOMS2 0x04
#  define WOMS_WOMS1 0x02
#  define WOMS_WOMS0 0x01
/* #define RESERVED_0x024f 0x024f */
#define PTM 0x0250
#  define PTM_PTM7 0x80
#  define PTM_PTM6 0x40
#  define PTM_PTM5 0x20
#  define PTM_PTM4 0x10
#  define PTM_PTM3 0x08
#  define PTM_PTM2 0x04
#  define PTM_PTM1 0x02
#  define PTM_PTM0 0x01
#define PTIM 0x0251
#  define PTIM_PTIM7 0x80
#  define PTIM_PTIM6 0x40
#  define PTIM_PTIM5 0x20
#  define PTIM_PTIM4 0x10
#  define PTIM_PTIM3 0x08
#  define PTIM_PTIM2 0x04
#  define PTIM_PTIM1 0x02
#  define PTIM_PTIM0 0x01
#define DDRM 0x0252
#  define DDRM_DDRM7 0x80
#  define DDRM_DDRM6 0x40
#  define DDRM_DDRM5 0x20
#  define DDRM_DDRM4 0x10
#  define DDRM_DDRM3 0x08
#  define DDRM_DDRM2 0x04
#  define DDRM_DDRM1 0x02
#  define DDRM_DDRM0 0x01
#define RDRM 0x0253
#  define RDRM_RDRM7 0x80
#  define RDRM_RDRM6 0x40
#  define RDRM_RDRM5 0x20
#  define RDRM_RDRM4 0x10
#  define RDRM_RDRM3 0x08
#  define RDRM_RDRM2 0x04
#  define RDRM_RDRM1 0x02
#  define RDRM_RDRM0 0x01
#define PERM 0x0254
#  define PERM_PERM7 0x80
#  define PERM_PERM6 0x40
#  define PERM_PERM5 0x20
#  define PERM_PERM4 0x10
#  define PERM_PERM3 0x08
#  define PERM_PERM2 0x04
#  define PERM_PERM1 0x02
#  define PERM_PERM0 0x01
#define PPSM 0x0255
#  define PPSM_PPSM7 0x80
#  define PPSM_PPSM6 0x40
#  define PPSM_PPSM5 0x20
#  define PPSM_PPSM4 0x10
#  define PPSM_PPSM3 0x08
#  define PPSM_PPSM2 0x04
#  define PPSM_PPSM1 0x02
#  define PPSM_PPSM0 0x01
#define WOMM 0x0256
#  define WOMM_WOMM7 0x80
#  define WOMM_WOMM6 0x40
#  define WOMM_WOMM5 0x20
#  define WOMM_WOMM4 0x10
#  define WOMM_WOMM3 0x08
#  define WOMM_WOMM2 0x04
#  define WOMM_WOMM1 0x02
#  define WOMM_WOMM0 0x01
#define MODRR 0x0257
#  define MODRR_MODRR7 0x80
#  define MODRR_MODRR6 0x40
#  define MODRR_MODRR5 0x20
#  define MODRR_MODRR4 0x10
#  define MODRR_MODRR3 0x08
#  define MODRR_MODRR2 0x04
#  define MODRR_MODRR1 0x02
#  define MODRR_MODRR0 0x01
#define PTP 0x0258
#  define PTP_PTP7 0x80
#  define PTP_PTP6 0x40
#  define PTP_PTP5 0x20
#  define PTP_PTP4 0x10
#  define PTP_PTP3 0x08
#  define PTP_PTP2 0x04
#  define PTP_PTP1 0x02
#  define PTP_PTP0 0x01
#define PTIP 0x0259
#  define PTIP_PTIP7 0x80
#  define PTIP_PTIP6 0x40
#  define PTIP_PTIP5 0x20
#  define PTIP_PTIP4 0x10
#  define PTIP_PTIP3 0x08
#  define PTIP_PTIP2 0x04
#  define PTIP_PTIP1 0x02
#  define PTIP_PTIP0 0x01
#define DDRP 0x025a
#  define DDRP_DDRP7 0x80
#  define DDRP_DDRP6 0x40
#  define DDRP_DDRP5 0x20
#  define DDRP_DDRP4 0x10
#  define DDRP_DDRP3 0x08
#  define DDRP_DDRP2 0x04
#  define DDRP_DDRP1 0x02
#  define DDRP_DDRP0 0x01
#define RDRP 0x025b
#  define RDRP_RDRP7 0x80
#  define RDRP_RDRP6 0x40
#  define RDRP_RDRP5 0x20
#  define RDRP_RDRP4 0x10
#  define RDRP_RDRP3 0x08
#  define RDRP_RDRP2 0x04
#  define RDRP_RDRP1 0x02
#  define RDRP_RDRP0 0x01
#define PERP 0x025c
#  define PERP_PERP7 0x80
#  define PERP_PERP6 0x40
#  define PERP_PERP5 0x20
#  define PERP_PERP4 0x10
#  define PERP_PERP3 0x08
#  define PERP_PERP2 0x04
#  define PERP_PERP1 0x02
#  define PERP_PERP0 0x01
#define PPSP 0x025d
#  define PPSP_PPSP7 0x80
#  define PPSP_PPSP6 0x40
#  define PPSP_PPSP5 0x20
#  define PPSP_PPSP4 0x10
#  define PPSP_PPSP3 0x08
#  define PPSP_PPSP2 0x04
#  define PPSP_PPSP1 0x02
#  define PPSP_PPSP0 0x01
#define PIEP 0x025e
#  define PIEP_PIEP7 0x80
#  define PIEP_PIEP6 0x40
#  define PIEP_PIEP5 0x20
#  define PIEP_PIEP4 0x10
#  define PIEP_PIEP3 0x08
#  define PIEP_PIEP2 0x04
#  define PIEP_PIEP1 0x02
#  define PIEP_PIEP0 0x01
#define PIFP 0x025f
#  define PIFP_PIFP7 0x80
#  define PIFP_PIFP6 0x40
#  define PIFP_PIFP5 0x20
#  define PIFP_PIFP4 0x10
#  define PIFP_PIFP3 0x08
#  define PIFP_PIFP2 0x04
#  define PIFP_PIFP1 0x02
#  define PIFP_PIFP0 0x01
#define PTH 0x0260
#  define PTH_PTH7 0x80
#  define PTH_PTH6 0x40
#  define PTH_PTH5 0x20
#  define PTH_PTH4 0x10
#  define PTH_PTH3 0x08
#  define PTH_PTH2 0x04
#  define PTH_PTH1 0x02
#  define PTH_PTH0 0x01
#define PTIH 0x0261
#  define PTIH_PTIH7 0x80
#  define PTIH_PTIH6 0x40
#  define PTIH_PTIH5 0x20
#  define PTIH_PTIH4 0x10
#  define PTIH_PTIH3 0x08
#  define PTIH_PTIH2 0x04
#  define PTIH_PTIH1 0x02
#  define PTIH_PTIH0 0x01
#define DDRH 0x0262
#  define DDRH_DDRH7 0x80
#  define DDRH_DDRH6 0x40
#  define DDRH_DDRH5 0x20
#  define DDRH_DDRH4 0x10
#  define DDRH_DDRH3 0x08
#  define DDRH_DDRH2 0x04
#  define DDRH_DDRH1 0x02
#  define DDRH_DDRH0 0x01
#define RDRH 0x0263
#  define RDRH_RDRH7 0x80
#  define RDRH_RDRH6 0x40
#  define RDRH_RDRH5 0x20
#  define RDRH_RDRH4 0x10
#  define RDRH_RDRH3 0x08
#  define RDRH_RDRH2 0x04
#  define RDRH_RDRH1 0x02
#  define RDRH_RDRH0 0x01
#define PERH 0x0264
#  define PERH_PERH7 0x80
#  define PERH_PERH6 0x40
#  define PERH_PERH5 0x20
#  define PERH_PERH4 0x10
#  define PERH_PERH3 0x08
#  define PERH_PERH2 0x04
#  define PERH_PERH1 0x02
#  define PERH_PERH0 0x01
#define PPSH 0x0265
#  define PPSH_PPSH7 0x80
#  define PPSH_PPSH6 0x40
#  define PPSH_PPSH5 0x20
#  define PPSH_PPSH4 0x10
#  define PPSH_PPSH3 0x08
#  define PPSH_PPSH2 0x04
#  define PPSH_PPSH1 0x02
#  define PPSH_PPSH0 0x01
#define PIEH 0x0266
#  define PIEH_PIEH7 0x80
#  define PIEH_PIEH6 0x40
#  define PIEH_PIEH5 0x20
#  define PIEH_PIEH4 0x10
#  define PIEH_PIEH3 0x08
#  define PIEH_PIEH2 0x04
#  define PIEH_PIEH1 0x02
#  define PIEH_PIEH0 0x01
#define PIFH 0x0267
#  define PIFH_PIFH7 0x80
#  define PIFH_PIFH6 0x40
#  define PIFH_PIFH5 0x20
#  define PIFH_PIFH4 0x10
#  define PIFH_PIFH3 0x08
#  define PIFH_PIFH2 0x04
#  define PIFH_PIFH1 0x02
#  define PIFH_PIFH0 0x01
#define PTJ 0x0268
#  define PTJ_PTJ7 0x80
#  define PTJ_PTJ6 0x40
#  define PTJ_PTJ5 0x20
#  define PTJ_PTJ4 0x10
#  define PTJ_PTJ3 0x08
#  define PTJ_PTJ2 0x04
#  define PTJ_PTJ1 0x02
#  define PTJ_PTJ0 0x01
#define PTIJ 0x0269
#  define PTIJ_PTIJ7 0x80
#  define PTIJ_PTIJ6 0x40
#  define PTIJ_PTIJ5 0x20
#  define PTIJ_PTIJ4 0x10
#  define PTIJ_PTIJ3 0x08
#  define PTIJ_PTIJ2 0x04
#  define PTIJ_PTIJ1 0x02
#  define PTIJ_PTIJ0 0x01
#define DDRJ 0x026a
#  define DDRJ_DDRJ7 0x80
#  define DDRJ_DDRJ6 0x40
#  define DDRJ_DDRJ5 0x20
#  define DDRJ_DDRJ4 0x10
#  define DDRJ_DDRJ3 0x08
#  define DDRJ_DDRJ2 0x04
#  define DDRJ_DDRJ1 0x02
#  define DDRJ_DDRJ0 0x01
#define RDRJ 0x026b
#  define RDRJ_RDRJ7 0x80
#  define RDRJ_RDRJ6 0x40
#  define RDRJ_RDRJ5 0x20
#  define RDRJ_RDRJ4 0x10
#  define RDRJ_RDRJ3 0x08
#  define RDRJ_RDRJ2 0x04
#  define RDRJ_RDRJ1 0x02
#  define RDRJ_RDRJ0 0x01
#define PERJ 0x026c
#  define PERJ_PERJ7 0x80
#  define PERJ_PERJ6 0x40
#  define PERJ_PERJ5 0x20
#  define PERJ_PERJ4 0x10
#  define PERJ_PERJ3 0x08
#  define PERJ_PERJ2 0x04
#  define PERJ_PERJ1 0x02
#  define PERJ_PERJ0 0x01
#define PPSJ 0x026d
#  define PPSJ_PPSJ7 0x80
#  define PPSJ_PPSJ6 0x40
#  define PPSJ_PPSJ5 0x20
#  define PPSJ_PPSJ4 0x10
#  define PPSJ_PPSJ3 0x08
#  define PPSJ_PPSJ2 0x04
#  define PPSJ_PPSJ1 0x02
#  define PPSJ_PPSJ0 0x01
#define PIEJ 0x026e
#  define PIEJ_PIEJ7 0x80
#  define PIEJ_PIEJ6 0x40
#  define PIEJ_PIEJ5 0x20
#  define PIEJ_PIEJ4 0x10
#  define PIEJ_PIEJ3 0x08
#  define PIEJ_PIEJ2 0x04
#  define PIEJ_PIEJ1 0x02
#  define PIEJ_PIEJ0 0x01
#define PIFJ 0x026f
#  define PIFJ_PIFJ7 0x80
#  define PIFJ_PIFJ6 0x40
#  define PIFJ_PIFJ5 0x20
#  define PIFJ_PIFJ4 0x10
#  define PIFJ_PIFJ3 0x08
#  define PIFJ_PIFJ2 0x04
#  define PIFJ_PIFJ1 0x02
#  define PIFJ_PIFJ0 0x01

/* reserved: 0x0270..0x027f */

/* reserved: 0x0280..0x03ff */

#endif /* __IO_MC9S12A64_H */
